# Machine Learning March Major Project

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
pd.options.display.max_seq_items = 2000
pd.set_option('display.max_rows', =100)

In [440]:
from sklearn.preprocessing import LabelEncoder

In [441]:
df=pd.read_csv("D:\\sk majorproject\\adult.csv")
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [442]:
df.shape

(32560, 15)

In [443]:
df.columns

Index(['39', ' State-gov', ' 77516', ' Bachelors', ' 13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' 2174', ' 0',
       ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [444]:
duplicate = df[df.duplicated()]

In [445]:
duplicate.shape

(24, 15)

In [446]:
df.drop_duplicates(keep=False,inplace=True)

In [447]:
df.shape

(32513, 15)

</br>
</br>
</br>

## 1. Renaming the column names

In [448]:
df.columns= ['Age','Workclass','Fnlwgt','Education','Education_num','Marital_status','Occupation','relationship','race','sex', 'capital_gain','capital_loss', 'hours_per_week' ,'native_country', 'income']
df.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

#### Adding the previous column names as first row

In [449]:
new_row = pd.DataFrame({'Age':39,'Workclass':'State-gov','Fnlwgt':'77516','Education':'Bachelors','Education_num':13,'Marital_status':'Never-married','Occupation':'Adm-clerical','relationship':'Not-in-family','race':'White','sex':'Male', 'capital_gain':2174,'capital_loss':0, 'hours_per_week':40 ,'native_country':'United-States', 'income':'<=50K'}, index =[0])
 
df = pd.concat([new_row, df[:]]).reset_index(drop = True)
df.head(5)

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

</br>
</br>
</br>

## 2. Handling Null values</br>

In [450]:
df.isnull().sum()

Age               0
Workclass         0
Fnlwgt            0
Education         0
Education_num     0
Marital_status    0
Occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

</br>

In [451]:
df.columns

Index(['Age', 'Workclass', 'Fnlwgt', 'Education', 'Education_num',
       'Marital_status', 'Occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'income'],
      dtype='object')

## Column - Age

In [452]:
df['Age'].unique()

array([39, 50, 38, 53, 28, 37, 49, 52, 31, 42, 30, 23, 32, 40, 34, 25, 43,
       54, 35, 59, 56, 19, 20, 45, 22, 48, 21, 24, 57, 44, 41, 29, 18, 47,
       46, 36, 79, 27, 67, 33, 76, 17, 55, 61, 70, 64, 71, 68, 66, 51, 58,
       26, 60, 90, 75, 65, 77, 62, 63, 80, 72, 74, 69, 73, 81, 78, 88, 82,
       83, 84, 85, 86, 87], dtype=int64)

#### Changing Age column into AgeRange</br>

In [453]:
bins = [0, 2, 18, 35, 65, np.inf]
names = ['<2', '2-18', '18-35', '35-65', '65+']

df['AgeRange'] = pd.cut(df['Age'],bins,labels=names)

In [454]:
df.head()

,Age,Workclass,Fnlwgt,Education,Education_num,Marital_status,Occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,AgeRange
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,35-65
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,35-65
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,35-65
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,35-65
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,18-35

In [455]:
df.drop(['Age'], axis = 1,inplace=True)

In [456]:
lb=LabelEncoder()
df['AgeRange']=lb.fit_transform(df['AgeRange'])
df['AgeRange'].value_counts()

2    16462
0    13951
3     1156
1      945
Name: AgeRange, dtype: int64

### Column - Workclass

In [457]:
df['Workclass'].unique()

array(['State-gov', ' Self-emp-not-inc', ' Private', ' State-gov',
       ' Federal-gov', ' Local-gov', ' ?', ' Self-emp-inc',
       ' Without-pay', ' Never-worked'], dtype=object)

In [458]:
df['Workclass'] = df['Workclass'].replace([' State-gov'],'State-gov')

In [459]:
df['Workclass'] = df['Workclass'].replace([' ?'],'private')

In [460]:
df['Workclass'].unique()

array(['State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', 'private', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [461]:

df['Workclass']=lb.fit_transform(df['Workclass'])
df['Workclass'].value_counts()

3    22651
5     2539
1     2093
8     1836
7     1298
4     1116
0      960
6       14
2        7
Name: Workclass, dtype: int64

### Column - Fnlwgt

In [462]:
df['Fnlwgt'].unique()

array(['77516', 83311, 215646, ..., 34066, 84661, 257302], dtype=object)

In [463]:
len(df['Fnlwgt'].unique())

21638

In [464]:
df['Fnlwgt']=pd.to_numeric(df['Fnlwgt'])

In [465]:
df['Fnlwgt'].dtype

dtype('int64')

In [466]:

df['Fnlwgt']=lb.fit_transform(df['Fnlwgt'])
df['Fnlwgt'].value_counts()

8875     13
5814     13
13070    13
4984     12
5673     12
         ..
15210     1
19000     1
6999      1
18795     1
16521     1
Name: Fnlwgt, Length: 21638, dtype: int64

### Column - Education

In [467]:
df['Education'].unique()

array(['Bachelors', ' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [468]:
df['Education'] = df['Education'].replace(['Bachelors'],' Bachelors')

In [469]:
df['Education'].unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [470]:
df['Education'].unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [471]:
df['Education'].value_counts()

 HS-grad         10487
 Some-college     7273
 Bachelors        5351
 Masters          1721
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           644
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           331
 1st-4th           165
 Preschool          49
Name: Education, dtype: int64

In [472]:
df['Education']=lb.fit_transform(df['Education'])
df['Education'].value_counts()

11    10487
15     7273
9      5351
12     1721
8      1382
1      1175
7      1067
0       933
5       644
14      576
6       514
2       433
10      413
4       331
3       165
13       49
Name: Education, dtype: int64

### Column - Education_num

In [473]:
df['Education_num'].unique()

array([13,  9,  7, 14,  5, 10, 12, 11,  4, 16, 15,  3,  6,  2,  1,  8],
      dtype=int64)

In [474]:

df['Education_num']=lb.fit_transform(df['Education_num'])
df['Education_num'].value_counts()

8     10487
9      7273
12     5351
13     1721
10     1382
6      1175
11     1067
5       933
3       644
14      576
4       514
7       433
15      413
2       331
1       165
0        49
Name: Education_num, dtype: int64

### Column - Marital_status

In [475]:
df['Marital_status'].unique()

array(['Never-married', ' Married-civ-spouse', ' Divorced',
       ' Married-spouse-absent', ' Never-married', ' Separated',
       ' Married-AF-spouse', ' Widowed'], dtype=object)

In [476]:
df['Marital_status'] = df['Marital_status'].replace(['Never-married'],' Never-married')

In [477]:
df['Marital_status'].unique()

array([' Never-married', ' Married-civ-spouse', ' Divorced',
       ' Married-spouse-absent', ' Separated', ' Married-AF-spouse',
       ' Widowed'], dtype=object)

In [478]:
df['Marital_status']=lb.fit_transform(df['Marital_status'])
df['Marital_status'].value_counts()

2    14964
4    10652
0     4439
5     1025
6      993
3      418
1       23
Name: Marital_status, dtype: int64

### Column - relationship

In [479]:
df['relationship'].unique()

array(['Not-in-family', ' Husband', ' Not-in-family', ' Wife',
       ' Own-child', ' Unmarried', ' Other-relative'], dtype=object)

In [480]:
df['relationship'] = df['relationship'].replace(['Not-in-family'],' Not-in-family')

In [481]:
df['relationship'].unique()

array([' Not-in-family', ' Husband', ' Wife', ' Own-child', ' Unmarried',
       ' Other-relative'], dtype=object)

In [482]:
df['relationship']=lb.fit_transform(df['relationship'])
df['relationship'].value_counts()

0    13181
1     8280
3     5060
4     3444
5     1568
2      981
Name: relationship, dtype: int64

### Column - race

In [483]:
df['race'].unique()

array(['White', ' White', ' Black', ' Asian-Pac-Islander',
       ' Amer-Indian-Eskimo', ' Other'], dtype=object)

In [484]:
df['race'] = df['race'].replace(['White'],' White')

In [485]:
df['race'].unique()

array([' White', ' Black', ' Asian-Pac-Islander', ' Amer-Indian-Eskimo',
       ' Other'], dtype=object)

In [486]:
df['race']=lb.fit_transform(df['race'])
df['race'].value_counts()

4    27775
2     3120
1     1037
0      311
3      271
Name: race, dtype: int64

### Column - sex

In [487]:
df['sex'].unique()

array(['Male', ' Male', ' Female'], dtype=object)

In [488]:
df['sex'] = df['sex'].replace(['Male'],' Male')

In [489]:
df['sex'].unique()

array([' Male', ' Female'], dtype=object)

In [490]:
df['sex']=lb.fit_transform(df['sex'])
df['sex'].value_counts()

1    21760
0    10754
Name: sex, dtype: int64

### Column - capital_gain

In [491]:
df['capital_gain'].value_counts()

0        29802
15024      347
7688       284
7298       246
99999      159
         ...
1111         1
2538         1
22040        1
4931         1
5060         1
Name: capital_gain, Length: 119, dtype: int64

In [492]:
df['capital_gain']=lb.fit_transform(df['capital_gain'])
df['capital_gain'].value_counts()

0      29802
108      347
94       284
91       246
118      159
       ...
8          1
37         1
112        1
75         1
78         1
Name: capital_gain, Length: 119, dtype: int64

### Column - capital_loss

In [493]:
df['capital_loss'].value_counts()

0       30995
1902      202
1977      168
1887      159
1848       51
        ...
2080        1
1539        1
1844        1
2489        1
1411        1
Name: capital_loss, Length: 92, dtype: int64

In [494]:
df['capital_loss']=lb.fit_transform(df['capital_loss'])
df['capital_loss'].value_counts()

0     30995
47      202
50      168
46      159
44       51
      ...
57        1
19        1
43        1
81        1
16        1
Name: capital_loss, Length: 92, dtype: int64

### Column - hours_per_week

In [495]:
df['capital_loss'].value_counts()

0     30995
47      202
50      168
46      159
44       51
      ...
57        1
19        1
43        1
81        1
16        1
Name: capital_loss, Length: 92, dtype: int64

In [496]:
df['hours_per_week']=lb.fit_transform(df['hours_per_week'])
df['hours_per_week'].value_counts()

39    15192
49     2815
44     1822
59     1475
34     1295
      ...
78        1
87        1
82        1
71        1
88        1
Name: hours_per_week, Length: 94, dtype: int64

### Column - native_country

In [497]:
df['native_country'].unique()

array(['United-States', ' United-States', ' Cuba', ' Jamaica', ' India',
       ' ?', ' Mexico', ' South', ' Puerto-Rico', ' Honduras', ' England',
       ' Canada', ' Germany', ' Iran', ' Philippines', ' Italy',
       ' Poland', ' Columbia', ' Cambodia', ' Thailand', ' Ecuador',
       ' Laos', ' Taiwan', ' Haiti', ' Portugal', ' Dominican-Republic',
       ' El-Salvador', ' France', ' Guatemala', ' China', ' Japan',
       ' Yugoslavia', ' Peru', ' Outlying-US(Guam-USVI-etc)', ' Scotland',
       ' Trinadad&Tobago', ' Greece', ' Nicaragua', ' Vietnam', ' Hong',
       ' Ireland', ' Hungary', ' Holand-Netherlands'], dtype=object)

In [498]:
df['native_country'].value_counts()

 United-States                 29135
 Mexico                          635
 ?                               581
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Japan                            62
 Guatemala                        61
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
United-States                      1
 Holand-Netherlands                1
Name: native_country, dtype: int64

In [499]:
df['native_country'] = df['native_country'].replace([' ?'],' United-States')

In [500]:
df['native_country'].value_counts()

 United-States                 29716
 Mexico                          635
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Japan                            62
 Guatemala                        61
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
United-States                      1
 Holand-Netherlands                1
Name: native_country, dtype: int64

In [501]:
df['native_country']=lb.fit_transform(df['native_country'])
df['native_country'].value_counts()

38    29716
25      635
29      198
10      137
1       121
32      114
7       106
18      100
4        95
8        90
22       81
34       80
2        75
21       73
5        70
39       67
23       62
12       61
30       60
3        59
35       51
13       44
19       43
31       37
26       34
28       31
11       29
9        29
6        28
20       24
16       20
37       19
0        19
36       18
24       18
40       16
27       14
17       13
15       13
33       12
41        1
14        1
Name: native_country, dtype: int64

### Column - income

In [502]:
df['income'].value_counts()

 <=50K    24676
 >50K      7837
<=50K         1
Name: income, dtype: int64

In [503]:
df['income'] = df['income'].replace(['<=50K'],' <=50K')

In [504]:
df['income'].value_counts()

 <=50K    24677
 >50K      7837
Name: income, dtype: int64

In [505]:
df['income']=lb.fit_transform(df['income'])
df['income'].value_counts()

0    24677
1     7837
Name: income, dtype: int64

### n

### Column - Occupation

In [506]:
df['Occupation'].unique()

array(['Adm-clerical', ' Exec-managerial', ' Handlers-cleaners',
       ' Prof-specialty', ' Other-service', ' Adm-clerical', ' Sales',
       ' Craft-repair', ' Transport-moving', ' Farming-fishing',
       ' Machine-op-inspct', ' Tech-support', ' ?', ' Protective-serv',
       ' Armed-Forces', ' Priv-house-serv'], dtype=object)

In [507]:
df['Occupation'] = df['Occupation'].replace(['Adm-clerical'],' Adm-clerical')

In [508]:
df['Occupation'].value_counts()

 Prof-specialty       4132
 Craft-repair         4089
 Exec-managerial      4064
 Adm-clerical         3766
 Sales                3650
 Other-service        3287
 Machine-op-inspct    1998
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1368
 Farming-fishing       990
 Tech-support          926
 Protective-serv       649
 Priv-house-serv       146
 Armed-Forces            9
Name: Occupation, dtype: int64

In [509]:
df1=df.loc[df['Occupation'] == ' ?']
df2=df.loc[df['Occupation'] != ' ?']

In [510]:
df1.shape

(1843, 15)

In [511]:
df2.shape

(30671, 15)

In [531]:
df1['Occupation']=lb.fit_transform(df1['Occupation'])
df1['Occupation'].value_counts()

C:\Users\heman\AppData\Local\Temp/ipykernel_24244/1366951021.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Occupation']=lb.fit_transform(df1['Occupation'])

0    1843
Name: Occupation, dtype: int64

In [532]:
df2['Occupation']=lb.fit_transform(df2['Occupation'])
df2['Occupation'].value_counts()

C:\Users\heman\AppData\Local\Temp/ipykernel_24244/213460150.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Occupation']=lb.fit_transform(df2['Occupation'])

9     4132
2     4089
3     4064
0     3766
11    3650
7     3287
6     1998
13    1597
5     1368
4      990
12     926
10     649
8      146
1        9
Name: Occupation, dtype: int64

In [533]:
df1.columns

Index(['Workclass', 'Fnlwgt', 'Education', 'Education_num', 'Marital_status',
       'Occupation', 'relationship', 'race', 'sex', 'capital_gain',
       'capital_loss', 'hours_per_week', 'native_country', 'income',
       'AgeRange'],
      dtype='object')

In [534]:
df1x= df1.drop('Occupation',axis=1)

In [535]:
df1x.shape

(1843, 14)

In [536]:
df1y= df1.iloc[:,5]

In [544]:
df1y

27       0
61       0
69       0
77       0
106      0
        ..
32483    0
32484    0
32492    0
32494    0
32495    0
Name: Occupation, Length: 1843, dtype: int32

In [538]:
df2x= df2.drop('Occupation',axis=1)

In [539]:
df2x.shape

(30671, 14)

In [540]:
df2y= df2.iloc[:,5]

In [547]:
df2y

0         0
1         3
2         5
3         5
4         9
         ..
32509    12
32510     6
32511     0
32512     0
32513     3
Name: Occupation, Length: 30671, dtype: int32

In [542]:
df2x.columns

Index(['Workclass', 'Fnlwgt', 'Education', 'Education_num', 'Marital_status',
       'relationship', 'race', 'sex', 'capital_gain', 'capital_loss',
       'hours_per_week', 'native_country', 'income', 'AgeRange'],
      dtype='object')

In [543]:
df2y

0         0
1         3
2         5
3         5
4         9
         ..
32509    12
32510     6
32511     0
32512     0
32513     3
Name: Occupation, Length: 30671, dtype: int32

In [545]:
from sklearn.ensemble import RandomForestClassifier

In [546]:
m= RandomForestClassifier()
m.fit(df2x,df2y)

RandomForestClassifier()

In [548]:
print('training Score',m.score(df2x,df2y))
df1y=m.predict(df1x)
print(df1y)

training Score 0.9957940725767012
[10  2  9 ...  9  7 10]

In [550]:
np.unique(df1y, return_counts=True)

(array([ 0,  2,  3,  4,  5,  6,  7,  9, 10, 11, 12, 13]),
 array([457, 119, 137, 101,  15,  21, 440, 312,  98,  36,  30,  77],
       dtype=int64))

In [551]:
df1x.shape

(1843, 14)

In [552]:
df1y.shape

(1843,)

In [553]:
df2x.shape

(30671, 14)

In [554]:
df2y.shape

(30671,)

In [555]:
df1x['Occupation']=df1y

In [556]:
df1x.head()

,Workclass,Fnlwgt,Education,Education_num,Marital_status,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,AgeRange,Occupation
27,8,10520,15,9,2,0,1,1,0,0,59,34,1,2,10
61,8,18032,5,3,3,1,4,1,0,0,39,38,0,0,2
69,8,12801,15,9,4,3,4,1,0,0,39,38,0,0,9
77,8,13861,0,5,2,0,4,1,0,0,1,38,0,3,2
106,8,18385,0,5,4,3,4,0,116,0,31,38,0,1,7

In [557]:
df2x['Occupation']=df2y

In [558]:
df2x.head()

,Workclass,Fnlwgt,Education,Education_num,Marital_status,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,AgeRange,Occupation
0,7,2671,9,12,4,1,4,1,25,0,39,41,0,2,0
1,5,2926,9,12,2,0,4,1,0,0,12,38,0,2,3
2,3,14082,11,8,0,1,4,1,0,0,39,38,0,2,5
3,3,15332,1,6,2,0,2,1,0,0,39,38,0,2,5
4,3,19346,9,12,2,5,2,0,0,0,39,4,0,0,9

In [560]:
df1x.head()

,Workclass,Fnlwgt,Education,Education_num,Marital_status,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,AgeRange,Occupation
27,8,10520,15,9,2,0,1,1,0,0,59,34,1,2,10
61,8,18032,5,3,3,1,4,1,0,0,39,38,0,0,2
69,8,12801,15,9,4,3,4,1,0,0,39,38,0,0,9
77,8,13861,0,5,2,0,4,1,0,0,1,38,0,3,2
106,8,18385,0,5,4,3,4,0,116,0,31,38,0,1,7

In [566]:
df_final=df2x.append(df1x)

In [567]:
df_final

,Workclass,Fnlwgt,Education,Education_num,Marital_status,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,AgeRange,Occupation
0,7,2671,9,12,4,1,4,1,25,0,39,41,0,2,0
1,5,2926,9,12,2,0,4,1,0,0,12,38,0,2,3
2,3,14082,11,8,0,1,4,1,0,0,39,38,0,2,5
3,3,15332,1,6,2,0,2,1,0,0,39,38,0,2,5
4,3,19346,9,12,2,5,2,0,0,0,39,4,0,0,9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32483,8,18856,9,12,2,5,4,0,0,0,54,38,1,0,9
32484,8,673,9,12,4,1,1,0,0,0,93,38,0,0,9
32492,8,17801,10,15,2,0,4,1,0,0,9,38,1,3,9
32494,8,13007,11,8,5,1,2,0,0,0,31,38,0,2,7
32495,8,6333,11,8,2,0,4,1,0,0,24,38,0,3,10

## 3. Spliting the Dataset into training and testing data

In [568]:
from sklearn.model_selection import train_test_split

In [580]:
x=df_final.drop(['income'],axis=1)
y=df_final.iloc[:,-3]
print(x.shape)
print(y.shape)

(32514, 14)
(32514,)

In [581]:
print(type(x))
print(type(y))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [582]:
x.head()

,Workclass,Fnlwgt,Education,Education_num,Marital_status,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,AgeRange,Occupation
0,7,2671,9,12,4,1,4,1,25,0,39,41,2,0
1,5,2926,9,12,2,0,4,1,0,0,12,38,2,3
2,3,14082,11,8,0,1,4,1,0,0,39,38,2,5
3,3,15332,1,6,2,0,2,1,0,0,39,38,2,5
4,3,19346,9,12,2,5,2,0,0,0,39,4,0,9

In [583]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: income, dtype: int32

In [584]:
x_tr,x_te,y_tr,y_te=train_test_split(x,y,test_size=0.20)
print(x_tr.shape)
print(x_te.shape)
print(y_tr.shape)
print(y_te.shape)

(26011, 14)
(6503, 14)
(26011,)
(6503,)

## 4. Applying the classifier models on training dataset and generating predictions for the            test dataset

#### 4a. DECISIONTREE CLASSIFIER

In [585]:
from sklearn.tree import DecisionTreeClassifier

In [586]:
m1= DecisionTreeClassifier()
m1.fit(x_tr,y_tr)

DecisionTreeClassifier()

In [587]:
print('training Score',m1.score(x_tr,y_tr))
print('testing Score',m1.score(x_te,y_te))
ypred_m1=m1.predict(x_te)
print(ypred_m1)

training Score 0.999769328361078
testing Score 0.8087036752268184
[0 1 0 ... 0 1 0]

#### 4b. RANDOMFOREST CLASSIFIER

In [588]:
from sklearn.ensemble import RandomForestClassifier

In [589]:
m2= RandomForestClassifier()
m2.fit(x_tr,y_tr)

RandomForestClassifier()

In [591]:
print('training Score',m2.score(x_tr,y_tr))
print('testing Score',m2.score(x_te,y_te))
ypred_m2=m2.predict(x_te)
print(ypred_m2)

training Score 0.9996924378147707
testing Score 0.846839920036906
[0 1 0 ... 0 0 0]

#### 4c. KNN CLASSIFIER

In [592]:
from sklearn.neighbors import KNeighborsClassifier

In [619]:
m3=KNeighborsClassifier(n_neighbors=11)
m3.fit(x_tr,y_tr)

KNeighborsClassifier(n_neighbors=11)

In [620]:
print('training Score',m3.score(x_tr,y_tr))
print('testing Score',m3.score(x_te,y_te))
ypred_m3=m3.predict(x_te)
print(ypred_m3)

training Score 0.8159240321402483
testing Score 0.7850222974011994
[0 0 0 ... 0 0 0]

#### 4d. LOGISTIC REGRESSION

In [621]:
from sklearn.linear_model import LogisticRegression

In [622]:
m4=LogisticRegression()
m4.fit(x_tr,y_tr)

C:\Users\heman\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [ ]:
print('training Score',m4.score(x_tr,y_tr))
print('testing Score',m4.score(x_te,y_te))
ypred_m4=m4.predict(x_te)
print(ypred_m4)

#### 4e. SVM CLASSIFIER

In [624]:
from sklearn.svm import SVC

In [ ]:
m5=SVC(kernel='linear',C=10)
m5.fit(x_tr,y_tr)

In [ ]:
print('training Score',m5.score(x_tr,y_tr))
print('testing Score',m5.score(x_te,y_te))
ypred_m5=m5.predict(x_te)
print(ypred_m5)